app/Controllers/Approval.php

    public function index()
    {
        // Hanya pimpinan yang boleh mengakses
        if(session()->get('role') != 'pimpinan'){
            return redirect()->to('/dashboard');
        }

        $arsip = $this->arsip
            ->select('arsip.*, klien.nama_klien, staf.nama')
            ->join('klien','klien.id_klien = arsip.id_klien')
            ->join('staf','staf.id_staf = arsip.id_staf')
            ->where('arsip.status_penghapusan', 'pending')
            ->findAll();

        $klien = $this->klien
            ->select('klien.*, staf.nama')
            ->join('staf','staf.id_staf = klien.id_staf')
            ->where('klien.status_penghapusan','pending')
            ->findAll();
---
SELECT `arsip`.*, `klien`.`nama_klien`, `staf`.`nama`
FROM `arsip`
JOIN `klien` ON `klien`.`id_klien` = `arsip`.`id_klien`
JOIN `staf` ON `staf`.`id_staf` = `arsip`.`id_staf`
WHERE `arsip`.`status_penghapusan` = 'pending'
SELECT `klien`.*, `staf`.`nama`
FROM `klien`
JOIN `staf` ON `staf`.`id_staf` = `klien`.`id_staf`
WHERE `klien`.`status_penghapusan` = 'pending'