app/Controllers/Auth.php

SELECT *
FROM `pimpinan`
WHERE `username` = 'juan'
 LIMIT 1
---
    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $pimpinanModel = new PimpinanModel();
        $stafModel     = new StafModel();

        /*
        ==========================
        LOGIN PIMPINAN
        ==========================
        */

        $pimpinan = $pimpinanModel
                        ->where('username', $username)
                        ->first();