app/Controllers/Dashboard.php

    public function index()
{
    if (!session()->get('logged_in')) {
        return redirect()->to('/');
    }

    $stafModel    = new StafModel();
    $klienModel   = new KlienModel();
    $arsipModel   = new ArsipModel();
    $laporanModel = new LaporanModel();

    if(session()->get('role') == 'pimpinan'){

        $data = [

            'title' => 'Dashboard SIMARKUM',

            'total_staf'     => $stafModel->countAll(),

            'total_klien'    => $klienModel->countAll(),

            'total_arsip'    => $arsipModel->countAll(),

            'total_laporan' => $arsipModel->countAll(),

            'approval_arsip' => $arsipModel
                             ->where('status_penghapusan','pending')
                             ->countAllResults(),

            'approval_klien' => $klienModel
                            ->where('status_penghapusan','pending')
                            ->countAllResults(),

            'statistik'      => $arsipModel->statistikBulanan(),

            'arsip_terbaru'  => $arsipModel
                ->select('arsip.*, klien.nama_klien')
                ->join('klien','klien.id_klien=arsip.id_klien')
                ->orderBy('tanggal','DESC')
                ->findAll(5)
---
SELECT COUNT(*) AS `numrows` FROM `staf`
SELECT COUNT(*) AS `numrows` FROM `klien`
SELECT COUNT(*) AS `numrows` FROM `arsip`
SELECT COUNT(*) AS `numrows`
FROM `arsip`
WHERE `status_penghapusan` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `klien`
WHERE `status_penghapusan` = 'pending'
SELECT `arsip`.*, `klien`.`nama_klien`
FROM `arsip`
JOIN `klien` ON `klien`.`id_klien`=`arsip`.`id_klien`
ORDER BY `tanggal` DESC
 LIMIT 5


    'title' => 'Dashboard SIMARKUM',

    'total_klien' => $klienModel
        ->where('id_staf', $idStaf)
        ->countAllResults(),

    'total_arsip' => $arsipModel
        ->where('id_staf', $idStaf)
        ->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `klien`
WHERE `id_staf` = '2'
SELECT COUNT(*) AS `numrows`
FROM `arsip`
WHERE `id_staf` = '2'


    'pending_total' => $pendingArsip + $pendingKlien,

    'arsip_terbaru' => $arsipModel
        ->select('arsip.*, klien.nama_klien')
        ->join('klien', 'klien.id_klien = arsip.id_klien')
        ->where('arsip.id_staf', $idStaf)
        ->orderBy('tanggal', 'DESC')
        ->findAll(5)
---
SELECT `arsip`.*, `klien`.`nama_klien`
FROM `arsip`
JOIN `klien` ON `klien`.`id_klien` = `arsip`.`id_klien`
WHERE `arsip`.`id_staf` = '2'
ORDER BY `tanggal` DESC
 LIMIT 5