app/Controllers/Laporan.php

SELECT `arsip`.*, `klien`.`nama_klien`, `staf`.`nama`
FROM `arsip`
JOIN `klien` ON `klien`.`id_klien` = `arsip`.`id_klien`
JOIN `staf` ON `staf`.`id_staf` = `arsip`.`id_staf`
WHERE `arsip`.`id_staf` = '2'
---
    public function cetak()
{
    $tanggal = $this->request->getGet('tanggal');
    $jenis   = $this->request->getGet('jenis_perkara');

    if(session()->get('role') == 'pimpinan'){

        $builder = $this->arsip
            ->select('arsip.*, klien.nama_klien, staf.nama')
            ->join('klien','klien.id_klien = arsip.id_klien')
            ->join('staf','staf.id_staf = arsip.id_staf');