app/Models/ArsipModel.php

SELECT MONTH(tanggal) as bulan, COUNT(id_arsip) as total
FROM `arsip`
GROUP BY MONTH(tanggal)
ORDER BY MONTH(tanggal)
---
   public function statistikBulanan()
{
    return $this->select("
            MONTH(tanggal) as bulan,
            COUNT(id_arsip) as total
        ")
        ->groupBy("MONTH(tanggal)")
        ->orderBy("MONTH(tanggal)")
        ->findAll();